Task A : Lambda + .apply()

Instructions (must use lambda + .apply()):

Replace missing values in math, english, and science with the mean of each column

Create a new column called average that contains the average score of each student

Create a new column called passed:

True if average â‰¥ 70

False otherwise

Rules:

Use .apply() with lambda

Do not write custom functions

Do not use loops

In [1]:
import pandas as pd

df = pd.DataFrame({
    "student": ["Ali", "Sara", "Omar", "Lina", "Huda", "Tariq"],
    "math": [90, 78, 65, 88, None, 55],
    "english": [85, 80, None, 92, 75, 60],
    "science": [88, None, 70, 90, 80, 58]
})

In [6]:
df['math'] = df['math'].apply(lambda x: df['math'].mean() if pd.isna(x) else x)
df['english'] = df['english'].apply(lambda x: df['english'].mean() if pd.isna(x) else x)
df['science'] = df['science'].apply(lambda x: df['science'].mean() if pd.isna(x) else x)
df['average'] = df.apply(lambda row: (row['math'] + row['english'] + row['science']) / 3, axis=1)
df['passed'] = df['average'].apply(lambda x: x >= 70)
df

  student  math  english  science    average  passed
0     Ali  90.0     85.0     88.0  87.666667    True
1    Sara  78.0     80.0     77.2  78.400000    True
2    Omar  65.0     78.4     70.0  71.133333    True
3    Lina  88.0     92.0     90.0  90.000000    True
4    Huda  75.2     75.0     80.0  76.733333    True
5   Tariq  55.0     60.0     58.0  57.666667   False

Task B : Using Functions

Instructions (must use regular functions):

Write a function called fill_missing(column)

- Takes a pandas column

- Replaces missing values with the column mean

- Returns the cleaned column

Write a function called calculate_average(row)

- Takes a row

- Returns the average of math, english, and science

Use these functions to:

- Clean the DataFrame

- Add a column called average

Rules:

Use def to define functions

Use .apply() to apply your functions

No lambda expressions in this task

In [5]:
def fill_missing(column):
    return column.fillna(column.mean())

def calculate_average(row):
    return (row['math'] + row['english'] + row['science']) / 3

df['math'] = fill_missing(df['math'])
df['english'] = fill_missing(df['english'])
df['science'] = fill_missing(df['science'])
df['average'] = df.apply(calculate_average, axis=1)
df

  student  math  english  science    average  passed
0     Ali  90.0     85.0     88.0  87.666667    True
1    Sara  78.0     80.0     77.2  78.400000    True
2    Omar  65.0     78.4     70.0  71.133333    True
3    Lina  88.0     92.0     90.0  90.000000    True
4    Huda  75.2     75.0     80.0  76.733333    True
5   Tariq  55.0     60.0     58.0  57.666667   False